PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_rsa.c
/***************************************************************************//**
* \file cy_cryptolite_rsa.c
* \version 2.80
*
* \brief
*  This file provides provides constant and parameters
*  for the API of the RSA in the Cryptolite driver.
*
********************************************************************************
* Copyright 2020-2021 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/
#include "cy_device.h"

#if defined (CY_IP_MXCRYPTOLITE)

#include "cy_cryptolite_vu.h"
#include "cy_cryptolite_rsa.h"
#include "cy_cryptolite_utils.h"

#if defined(__cplusplus)
extern "C" {
#endif

#if (CRYPTOLITE_VU_PRESENT == 1)
#if defined(CY_CRYPTOLITE_CFG_RSA_C)

#define CY_CRYPTOLITE_SHA1_PADDING_SIZE        (15u)
#define CY_CRYPTOLITE_SHA256_512_PADDING_SIZE  (19u)
/* Defines for the SHA algorithm */
/** Hash size for the SHA1 mode (in bytes)   */
#define CY_CRYPTOLITE_SHA1_DIGEST_SIZE          (20u)
/** Hash size for the SHA224 mode (in bytes) */
#define CY_CRYPTOLITE_SHA224_DIGEST_SIZE        (28u)
/** Hash size for the SHA256 mode (in bytes) */
#define CY_CRYPTOLITE_SHA256_DIGEST_SIZE        (32u)
/** Hash size for the SHA384 mode (in bytes) */
#define CY_CRYPTOLITE_SHA384_DIGEST_SIZE        (48u)
/** Hash size for the SHA512 mode (in bytes) */
#define CY_CRYPTOLITE_SHA512_DIGEST_SIZE        (64u)
/** Hash size for the SHA512_224 mode (in bytes) */
#define CY_CRYPTOLITE_SHA512_224_DIGEST_SIZE    (28u)
/** Hash size for the SHA512_256 mode (in bytes) */
#define CY_CRYPTOLITE_SHA512_256_DIGEST_SIZE    (32u)
/** The maximal Hash size for the SHA modes (in bytes). */
#define CY_CRYPTOLITE_SHA_MAX_DIGEST_SIZE       (CY_CRYPTOLITE_SHA512_DIGEST_SIZE)

static void Cy_Cryptolite_Rsa_Mont_Inv_Transform(
    CRYPTOLITE_Type *base,
    cy_stc_cryptolite_context_rsa_t *cfContext,
    uint8_t *p_a,             // bit_size
    uint8_t *p_barrett_u,     // bit_size+1
    uint8_t *p_mont_r_inv,    // bit_size+1
    uint8_t *p_mod,           // bit_size
    uint8_t *p_t1_2n1,        // 2*bit_size+1
    uint8_t *p_t2_2n1,        // 2*bit_size+1
    uint32_t bit_size)
{
    uint32_t    bitsize_p1 = VU_BITS_TO_WORDS(bit_size + 1U);
    uint32_t    bitsize    = VU_BITS_TO_WORDS(bit_size);
    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0U];
    cy_stc_cryptolite_descr_t *vu_struct1 = &cfContext->vu_desptr[1U];

    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct0, p_t1_2n1, VU_BITS_TO_WORDS(2U * bit_size), p_a, bitsize, p_mont_r_inv, bitsize);
    (void)Cy_Cryptolite_Vu_lsr_hw(base, vu_struct1, p_a, bitsize, p_t1_2n1, VU_BITS_TO_WORDS(2U * bit_size), bit_size);
    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct0, p_t2_2n1, VU_BITS_TO_WORDS(2U * bit_size), p_a, bitsize, p_barrett_u, bitsize_p1);
    (void)Cy_Cryptolite_Vu_lsr_hw(base, vu_struct1, p_a, bitsize, p_t2_2n1, VU_BITS_TO_WORDS(2U * bit_size), bit_size);
    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct0, p_t2_2n1, VU_BITS_TO_WORDS(2U * bit_size), p_a, bitsize, p_mod, bitsize);
    (void)Cy_Cryptolite_Vu_sub_hw(base, vu_struct1, p_t1_2n1, VU_BITS_TO_WORDS(bit_size + 2U), p_t1_2n1, VU_BITS_TO_WORDS(bit_size + 2U), p_t2_2n1, VU_BITS_TO_WORDS(bit_size + 2U));
    // Reduction.
    (void)Cy_Cryptolite_Vu_cond_sub_hw(base, vu_struct0, p_t2_2n1, bitsize_p1, p_t1_2n1, VU_BITS_TO_WORDS(bit_size + 2U), p_mod, bitsize);
    (void)Cy_Cryptolite_Vu_cond_sub_hw(base, vu_struct1, p_a, bitsize, p_t2_2n1, bitsize_p1, p_mod, bitsize);

    return;
}

static void Cy_Cryptolite_Rsa_Mont_Transform(
    CRYPTOLITE_Type *base,
    cy_stc_cryptolite_context_rsa_t *cfContext,
    uint8_t *p_a,             // bit_size
    uint8_t *p_barrett_u,     // bit_size+1
    uint8_t *p_mod,           // bit_size
    uint8_t *p_t1_2n1,        // 2*bit_size+1
    uint8_t *p_t2_2n1,        // 2*bit_size+1
    uint32_t bit_size)
{
    uint32_t    bitsize_p1 = VU_BITS_TO_WORDS(bit_size + 1U);
    uint32_t    bitsize    = VU_BITS_TO_WORDS(bit_size);
    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0U];
    cy_stc_cryptolite_descr_t *vu_struct1 = &cfContext->vu_desptr[1U];

    (void)Cy_Cryptolite_Vu_lsl(p_t1_2n1, VU_BITS_TO_WORDS(2U * bit_size), p_a, bitsize, bit_size);

    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct0, p_t2_2n1, VU_BITS_TO_WORDS(2U * bit_size), p_a, bitsize, p_barrett_u, bitsize_p1);
    (void)Cy_Cryptolite_Vu_lsr_hw(base, vu_struct1, p_a, bitsize, p_t2_2n1, VU_BITS_TO_WORDS(2U * bit_size), bit_size);
    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct0, p_t2_2n1, VU_BITS_TO_WORDS(2U * bit_size), p_a, bitsize, p_mod, bitsize);
    (void)Cy_Cryptolite_Vu_sub_hw(base, vu_struct1, p_t1_2n1, VU_BITS_TO_WORDS(bit_size + 2U), p_t1_2n1, VU_BITS_TO_WORDS(bit_size + 2U), p_t2_2n1, VU_BITS_TO_WORDS(bit_size + 2U));
    // Reduction.
    (void)Cy_Cryptolite_Vu_cond_sub_hw(base, vu_struct0, p_t2_2n1, bitsize_p1, p_t1_2n1, VU_BITS_TO_WORDS(bit_size + 2U), p_mod, bitsize);
    (void)Cy_Cryptolite_Vu_cond_sub_hw(base, vu_struct1, p_a, bitsize, p_t2_2n1, bitsize_p1, p_mod, bitsize);

    return;
}

static void Cy_Cryptolite_Rsa_Mont_Mul(
    CRYPTOLITE_Type *base,
    cy_stc_cryptolite_context_rsa_t *cfContext,
    uint8_t *p_z,             //   bit_size
    uint8_t *p_a,             //   bit_size
    uint8_t *p_b,             //   bit_size
    uint8_t *p_mont_mod_der,  //   bit_size
    uint8_t *p_mod,           //   bit_size
    uint8_t *p_t1_2n1,        // 2*bit_size + 1
    uint8_t *p_t2_2n1,        // 2*bit_size + 1
    uint32_t bit_size)
{
    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0U];
    cy_stc_cryptolite_descr_t *vu_struct1 = &cfContext->vu_desptr[1U];

