PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_rsa.c
    uint32_t    bitsize_p1 = VU_BITS_TO_WORDS(bit_size + 1U);
    uint32_t    bitsize    = VU_BITS_TO_WORDS(bit_size);

    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct0, p_t1_2n1, VU_BITS_TO_WORDS(2U * bit_size), p_a, bitsize, p_b, bitsize);
    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct1, p_z, bitsize, p_t1_2n1, bitsize, p_mont_mod_der, bitsize);
    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct0, p_t2_2n1, VU_BITS_TO_WORDS(2U * bit_size), p_z, bitsize, p_mod, bitsize);

    (void)Cy_Cryptolite_Vu_add_hw(base, vu_struct1, p_t1_2n1, VU_BITS_TO_WORDS(2U * bit_size + 1U), p_t2_2n1, VU_BITS_TO_WORDS(2U * bit_size), p_t1_2n1, VU_BITS_TO_WORDS(2U * bit_size));
    // Reduction.
    (void)Cy_Cryptolite_Vu_cond_sub_hw(base, vu_struct0, p_z, bitsize, &(p_t1_2n1[VU_BITS_TO_BYTES(bit_size)]), bitsize_p1, p_mod, bitsize);

    return;
}

static uint32_t Cy_Cryptolite_Vu_Get_Msb_Bit(cy_stc_cryptolite_context_rsa_t *cfContext, uint8_t* p_z, uint32_t  exp_bit_size);
/*******************************************************************************
* Function Name: Cy_Cryptolite_Vu_Get_Msb_Bit
****************************************************************************//**
*
* Function to calculate the position of the most significant bit set.
*
* \param cfContext
* The pointer to the rsa context.
*
* \param p_z
* The pointer to the data.
*
* \param exp_bit_size
* The size of the data .
*
* \return
*  The position of the most significant bit set.
*
*******************************************************************************/
static uint32_t Cy_Cryptolite_Vu_Get_Msb_Bit(cy_stc_cryptolite_context_rsa_t *cfContext, uint8_t* p_z, uint32_t  exp_bit_size)
{

    uint32_t i = 0u;
    uint32_t total_bit_processed = 0u;
    uint32_t exp_byte_align_size  = 0u;
    uint32_t exp_word_align_size  = 0u;
    uint32_t bit_offset = 0u;

    exp_byte_align_size =  CY_CRYPTOLITE_BYTE_SIZE_OF_BITS(exp_bit_size);
    exp_word_align_size = VU_BITS_TO_WORDS(exp_bit_size);
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Intentional pointer type conversion');
    uint32_t *exp_ptr = (uint32_t *)cfContext->p_buffer;

    Cy_Cryptolite_Vu_clr((uint8_t*) exp_ptr, VU_BYTES_TO_WORDS(CY_CRYPTOLITE_RSA_BUFFER_SIZE));
    Cy_Cryptolite_Setnumber((uint8_t *)exp_ptr, p_z, exp_byte_align_size);
    exp_ptr += exp_word_align_size;

    for (i = 0u; i < exp_word_align_size; i++)
    {
        exp_ptr--;

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3', 'signed 32-bit int" to different or narrower essential type "unsigned 32-bit int');
        if ((bit_offset = __CLZ(*exp_ptr)) != 32u)
        {
            total_bit_processed += bit_offset;

            return (exp_word_align_size * 32u) - total_bit_processed;
        }

        total_bit_processed += 32u;
    }

    return 0u;
}

static void Cy_Cryptolite_Rsa_Exp(
    CRYPTOLITE_Type *base,
    cy_stc_cryptolite_context_rsa_t *cfContext,
    uint8_t *p_z,             //   bit_size
    const uint8_t *p_a,       //   bit_size
    uint8_t *p_exp,           //   exp_bit_size
    uint8_t *p_barrett_u,     //   bit_size + 1
    uint8_t *p_mont_r_inv,    //   bit_size + 1      to allow for the addition
    uint8_t *p_mont_mod_der,  //   bit_size
    uint8_t *p_mod,           //   bit_size
    uint8_t *p_buffer,        // (2*bit_size + 1) + (2*bit_size + 1) + bit_size
    uint32_t bit_size,        // support 1024, 2048, 3072, 4096
    uint32_t exp_bit_size)    // most significant bit assumed to be '1'
{
    int         i;
    uint8_t    *p;
    uint8_t    *p_local_z = p_z;
    uint8_t    *p_t1_2n1  = &p_buffer[0U];
    uint8_t    *p_t2_2n1  = &p_buffer[4U * VU_BITS_TO_WORDS(2U * bit_size + 1U)];
    uint8_t    *p_t3_n    = &p_buffer[4U * VU_BITS_TO_WORDS(2U * bit_size + 1U) + 4U * VU_BITS_TO_WORDS(2U * bit_size + 1U)];
    uint8_t    *p_msg     = &p_buffer[4U * VU_BITS_TO_WORDS(2U * bit_size + 1U) + 4U * VU_BITS_TO_WORDS(2U * bit_size + 1U) + 4U * VU_BITS_TO_WORDS(bit_size)];

    uint32_t    bitsize    = VU_BITS_TO_WORDS(bit_size);
    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0U];
    cy_stc_cryptolite_descr_t *vu_struct1 = &cfContext->vu_desptr[1U];

    exp_bit_size = Cy_Cryptolite_Vu_Get_Msb_Bit(cfContext, p_exp, exp_bit_size);

    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct0, p_msg, bitsize, (uint8_t*)p_a, bitsize);

    Cy_Cryptolite_Rsa_Mont_Transform(base, cfContext, p_msg, p_barrett_u, p_mod, p_t1_2n1, p_t2_2n1, bit_size);

    (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct0, p_z, bitsize, p_msg, bitsize);


    if (exp_bit_size != 1U)
    {
        for (i = ((int)exp_bit_size - 2); i >= 0; i--)
        {
            Cy_Cryptolite_Rsa_Mont_Mul(base, cfContext, p_t3_n, p_z, p_z, p_mont_mod_der, p_mod, p_t1_2n1, p_t2_2n1, bit_size);

            if ((bool)Cy_Cryptolite_Vu_get_bit(p_exp, (uint32_t)i))
            {
                Cy_Cryptolite_Rsa_Mont_Mul(base, cfContext, p_z, p_t3_n, p_msg, p_mont_mod_der, p_mod, p_t1_2n1, p_t2_2n1, bit_size);
            }
            else
            {
                p = p_t3_n;
                p_t3_n = p_z;
                p_z = p;                  // swap
            }
        }

        if (p_local_z != p_z)
        {
            (void)Cy_Cryptolite_Vu_mov_hw(base, vu_struct1, p_local_z, bitsize, p_z, bitsize);
        }
    }

    Cy_Cryptolite_Rsa_Mont_Inv_Transform(base, cfContext, p_local_z, p_barrett_u, p_mont_r_inv, p_mod, p_t1_2n1, p_t2_2n1, bit_size);
}

static void Cy_Cryptolite_Rsa_Coeff(
    CRYPTOLITE_Type *base,
    cy_stc_cryptolite_context_rsa_t *cfContext,
    uint8_t *p_barrett_u,     // bit_size + 1
    uint8_t *p_mont_r_inv,    // bit_size + 1      to allow for the addition
    uint8_t *p_mont_mod_der,  // bit_size
    uint8_t *p_mod,           // bit_size
    uint8_t *p_buffer,        // (bit_size + 1) + (bit_size + 1)
    uint32_t bit_size)
{
    int         i;
    uint8_t    *p;
    uint32_t    sign;
    bool    even;
    uint32_t    bitsize_p1 = VU_BITS_TO_WORDS(bit_size + 1U);
    uint32_t    bitsize    = VU_BITS_TO_WORDS(bit_size);
    uint8_t    *p_t1_n1    = &p_buffer[0U];
    uint8_t    *p_t2_n1    = &p_buffer[4U * bitsize_p1];
    uint8_t    *p_dividend = p_t1_n1;

