PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_rsa.c
    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0U];
    cy_stc_cryptolite_descr_t *vu_struct1 = &cfContext->vu_desptr[1U];

    Cy_Cryptolite_Vu_clr(p_dividend, bitsize_p1);
    Cy_Cryptolite_Vu_set_bit(p_dividend, bit_size);
    Cy_Cryptolite_Vu_clr(p_barrett_u, bitsize_p1);

    Cy_Cryptolite_Vu_clr(p_mont_r_inv, bitsize_p1);
    Cy_Cryptolite_Vu_set_bit(p_mont_r_inv, 0U);
    Cy_Cryptolite_Vu_clr(p_mont_mod_der, bitsize);

    // Barrett "barrett_u[bit_size]",

    (void)Cy_Cryptolite_Vu_sub_hw(base, vu_struct0, p_dividend, bitsize_p1, p_dividend, bitsize_p1, p_mod, bitsize);

    Cy_Cryptolite_Vu_set_bit(p_barrett_u, bit_size);

    Cy_Cryptolite_Vu_wait_hw(base);
    Cy_Cryptolite_Vu_clr_bit(p_dividend, bit_size);                            // drop top bit
    (void)Cy_Cryptolite_Vu_lsl1_hw(base, vu_struct1, p_dividend, bitsize_p1, p_dividend, bitsize_p1);

    for (i = ((int)bit_size - 1); i >= 0; i--)
    {
        (void)Cy_Cryptolite_Vu_sub_hw(base, vu_struct0, p_t2_n1, bitsize_p1, p_dividend, bitsize_p1, p_mod, bitsize);
        (void)Cy_Cryptolite_Vu_lsr1_hw(base, vu_struct1, p_mont_mod_der, bitsize, p_mont_mod_der, bitsize);

        even = Cy_Cryptolite_Vu_test_even(p_mont_r_inv);

        if (even)
        {
            (void)Cy_Cryptolite_Vu_lsr1_hw(base, vu_struct0, p_mont_r_inv, bitsize,   p_mont_r_inv, bitsize);
        }
        else
        {
            (void)Cy_Cryptolite_Vu_add_hw(base, vu_struct0, p_mont_r_inv, bitsize_p1, p_mont_r_inv, bitsize, p_mod, bitsize);   // needs extra bit
            (void)Cy_Cryptolite_Vu_lsr1_hw(base, vu_struct1, p_mont_r_inv, bitsize_p1, p_mont_r_inv, bitsize_p1);
            Cy_Cryptolite_Vu_set_bit(p_mont_mod_der, bit_size - 1U);
        }

        sign = Cy_Cryptolite_Vu_get_bit(p_t2_n1, bit_size);   // sign = (dividend < mod)

        if (!(bool)sign)
        {
            Cy_Cryptolite_Vu_set_bit(p_barrett_u, (uint32_t)i);
            p = p_t2_n1;
            p_t2_n1 = p_dividend;
            p_dividend = p; // swap
        }

        Cy_Cryptolite_Vu_clr_bit(p_dividend, bit_size);    // drop top bit
        (void)Cy_Cryptolite_Vu_lsl1_hw(base, vu_struct0, p_dividend, bitsize_p1, p_dividend, bitsize_p1);
    }
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Rsa_Init
****************************************************************************//*
*
* Initialize the RSA context.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param cfContext
* The pointer to the CRYPTOLITE context.
*
* \param rsaBuffers
* The pointer to the RSA buffers.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Rsa_Init(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_rsa_t *cfContext,
        cy_stc_cryptolite_rsa_buffer_t *rsaBuffers)
{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_SUCCESS;
    uint32_t address_offset = 0u;

    if (base == NULL || cfContext == NULL || rsaBuffers == NULL)
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    /*Aligning the buffer address by 4 bytes*/
    if (((uint32_t)rsaBuffers & 0x03U) != 0u)
    {
        address_offset = 4u - ((uint32_t)rsaBuffers & 0x03U);
    }

    cfContext->p_buffer = (uint8_t*)((cy_stc_cryptolite_rsa_buffer_t *)((uint32_t)rsaBuffers + address_offset))->p_buffer;
    return status;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Rsa_Free
****************************************************************************//*
*
* Cleanup the RSA context.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param cfContext
* The pointer to the CRYPTOLITE context.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Rsa_Free(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_rsa_t *cfContext)
{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_SUCCESS;
    (void)base;

    if (base == NULL || cfContext == NULL)
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    Cy_Cryptolite_Vu_clr((uint8_t*)cfContext->vu_desptr, (sizeof(cy_stc_cryptolite_descr_t) * 2U) / 4U);

    if (cfContext->p_buffer != NULL)
    {
        Cy_Cryptolite_Vu_clr(cfContext->p_buffer, CY_CRYPTOLITE_RSA_BUFFER_SIZE / 4u);
        cfContext->p_buffer = NULL;
    }

    return status;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Core_Rsa_Proc
****************************************************************************//*
*
* RSA process algorithm based on the Montgomery algorithm
* using Barrett reduction
*
* https://en.wikipedia.org/wiki/RSA_%28cryptosystem%29
*
* Key, message, processedMessage  buffers must be 4 byte aligned and end with 4 byte boundary.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param cfContext
* The pointer to the CRYPTOLITE context.
*
* \param key
* The pointer to the \ref cy_stc_cryptolite_rsa_pub_key_t structure that stores
* public key.
*
* \param message
* The pointer to the message to be processed.
*
* \param messageSize
* The length of the message to be processed.
*
* \param processedMessage
* The pointer to processed message.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Rsa_Proc(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_rsa_t *cfContext,
        cy_stc_cryptolite_rsa_pub_key_t *key,
        uint8_t const *message,
        uint32_t messageSize,
        uint8_t *processedMessage)
{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_SUCCESS;
    (void)messageSize;

    uint8_t *barretCoefPtrRemap;
    uint8_t *inverseModuloPtrRemap;
    uint8_t *rBarPtrRemap;
    uint8_t *moduloPtrRemap;
    uint8_t *pubExpPtrRemap;
    uint8_t *messagePtrRemap;

    barretCoefPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(key->barretCoefPtr);
    inverseModuloPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(key->inverseModuloPtr);
    rBarPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(key->rBarPtr);
    moduloPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(key->moduloPtr);
    pubExpPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(key->pubExpPtr);
    messagePtrRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(message);

    if (key->preCalculatedCoeff == false)
    {
        Cy_Cryptolite_Rsa_Coeff(base, cfContext, barretCoefPtrRemap, inverseModuloPtrRemap, rBarPtrRemap, moduloPtrRemap, cfContext->p_buffer, key->moduloLength);
        key->preCalculatedCoeff = true;
    }

