PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_rsa.c
    Cy_Cryptolite_Rsa_Exp(base, cfContext, processedMessage, messagePtrRemap, pubExpPtrRemap, barretCoefPtrRemap, inverseModuloPtrRemap, rBarPtrRemap, moduloPtrRemap, cfContext->p_buffer, key->moduloLength, key->pubExpLength);

    return status;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Rsa_Coef
****************************************************************************//*
*
* Calculation constant coefficients to speed-up Montgomery algorithm.
* These coefficients are:
*                         coefficient for Barrett reduction,
*                         binary inverse of the modulo,
*                         result of (2^moduloLength mod modulo)
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param cfContext
* The pointer to the CRYPTOLITE context.
*
* \param key
* The pointer to the \ref cy_stc_cryptolite_rsa_pub_key_t structure that stores a
* public key.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Rsa_Coef(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_rsa_t *cfContext,
        cy_stc_cryptolite_rsa_pub_key_t *key)
{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_SUCCESS;

    uint8_t *barretCoefPtrRemap;
    uint8_t *inverseModuloPtrRemap;
    uint8_t *rBarPtrRemap;
    uint8_t *moduloPtrRemap;

    if ((NULL == key->barretCoefPtr) || (NULL == key->inverseModuloPtr) || (NULL == key->rBarPtr) || (NULL == key->moduloPtr) || (NULL == cfContext))
    {
        return  CY_CRYPTOLITE_BAD_PARAMS;
    }


    barretCoefPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(key->barretCoefPtr);
    inverseModuloPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(key->inverseModuloPtr);
    rBarPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(key->rBarPtr);
    moduloPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(key->moduloPtr);

    Cy_Cryptolite_Rsa_Coeff(base, cfContext, barretCoefPtrRemap, inverseModuloPtrRemap, rBarPtrRemap, moduloPtrRemap, cfContext->p_buffer, key->moduloLength);

    key->preCalculatedCoeff = true;

    return status;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Rsa_Verify
****************************************************************************//*
*
* RSA verification with checks for content, paddings and signature format.
* SHA digest of the message and decrypted message should be calculated before.
* Supports only PKCS1-v1_5 format, inside of this format supported padding
* using only SHA, cases with MD2 and MD5 are not supported.
* PKCS1-v1_5 described here, page 31:
* http://www.emc.com/collateral/white-papers/h11300-pkcs-1v2-2-rsa-cryptography-standard-wp.pdf
*
* The digest and decryptedSignature buffers must be 4 byte aligned
*
* Returns the verification result \ref cy_en_cryptolite_sig_verify_result_t.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param cfContext
* The pointer to the CRYPTOLITE context.
*
* \param verResult
* The pointer to the verification result \ref cy_en_cryptolite_sig_verify_result_t.
*
* \param digestType
* SHA mode used for hash calculation \ref cy_en_cryptolite_sha_mode_t.
*
* \param digest
* The pointer to the hash of the message or the message whose signature is to be verified.
*
* \param digestLength
* The length of the message whose signature is to be verified and is applicable for CY_CRYPTOLITE_MODE_SHA_NONE mode.
*
* \param decryptedSignature
* The pointer to the decrypted signature to be verified.
*
* \param decryptedSignatureLength
* The length of the decrypted signature to be verified (in bytes)
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
#ifdef CY_CRYPTOLITE_CFG_RSA_VERIFY_ENABLED
cy_en_cryptolite_status_t Cy_Cryptolite_Rsa_Verify(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_rsa_t *cfContext,
        cy_en_cryptolite_sig_verify_result_t *verResult,
        cy_en_cryptolite_sha_mode_t digestType,
        uint8_t const *digest,
        uint32_t digestLength,
        uint8_t const *decryptedSignature,
        uint32_t decryptedSignatureLength)
{
    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_SUCCESS;
    (void)base;
    (void)cfContext;

    uint8_t *digestRemap;
    uint8_t *decryptedSignatureRemap;

    digestRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(digest);
    decryptedSignatureRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(decryptedSignature);

    /* Encodings for hash functions */

#ifdef CY_CRYPTOLITE_CFG_RSA_VERIFY_SHA1
    static const uint8_t sha1EncStr[CY_CRYPTOLITE_SHA1_PADDING_SIZE] =
    {
        0x30u, 0x21u, 0x30u, 0x09u, 0x06u, 0x05u, 0x2Bu, 0x0Eu,
        0x03u, 0x02u, 0x1Au, 0x05u, 0x00u, 0x04u, 0x14u
    };
#endif /* #if (CY_CRYPTOLITE_CFG_RSA_VERIFY_SHA1 == 1) */

#ifdef CY_CRYPTOLITE_CFG_RSA_VERIFY_SHA256
    static const uint8_t sha224EncStr[CY_CRYPTOLITE_SHA256_512_PADDING_SIZE] =
    {
        0x30u, 0x2Du, 0x30u, 0x0Du, 0x06u, 0x09u, 0x60u, 0x86u,
        0x48u, 0x01u, 0x65u, 0x03u, 0x04u, 0x02u, 0x04u, 0x05u,
        0x00u, 0x04u, 0x1Cu
    };

    static const uint8_t sha256EncStr[CY_CRYPTOLITE_SHA256_512_PADDING_SIZE] =
    {
        0x30u, 0x31u, 0x30u, 0x0Du, 0x06u, 0x09u, 0x60u, 0x86u,
        0x48u, 0x01u, 0x65u, 0x03u, 0x04u, 0x02u, 0x01u, 0x05u,
        0x00u, 0x04u, 0x20u
    };
#endif /* #if (CY_CRYPTOLITE_CFG_RSA_VERIFY_SHA256 == 1) */

#ifdef CY_CRYPTOLITE_CFG_RSA_VERIFY_SHA512
    static const uint8_t sha384EncStr[CY_CRYPTOLITE_SHA256_512_PADDING_SIZE] =
    {
        0x30u, 0x41u, 0x30u, 0x0Du, 0x06u, 0x09u, 0x60u, 0x86u,
        0x48u, 0x01u, 0x65u, 0x03u, 0x04u, 0x02u, 0x02u, 0x05u,
        0x00u, 0x04u, 0x30u
    };

    static const uint8_t sha512EncStr[CY_CRYPTOLITE_SHA256_512_PADDING_SIZE] =
    {
        0x30u, 0x51u, 0x30u, 0x0Du, 0x06u, 0x09u, 0x60u, 0x86u,
        0x48u, 0x01u, 0x65u, 0x03u, 0x04u, 0x02u, 0x03u, 0x05u,
        0x00u, 0x04u, 0x40u
    };

    static const uint8_t sha512_224EncStr[CY_CRYPTOLITE_SHA256_512_PADDING_SIZE] =
    {
        0x30u, 0x2Du, 0x30u, 0x0Du, 0x06u, 0x09u, 0x60u, 0x86u,
        0x48u, 0x01u, 0x65u, 0x03u, 0x04u, 0x02u, 0x05u, 0x05u,
        0x00u, 0x04u, 0x1Cu
    };

    static const uint8_t sha512_256EncStr[CY_CRYPTOLITE_SHA256_512_PADDING_SIZE] =
    {
        0x30u, 0x31u, 0x30u, 0x0Du, 0x06u, 0x09u, 0x60u, 0x86u,
        0x48u, 0x01u, 0x65u, 0x03u, 0x04u, 0x02u, 0x06u, 0x05u,
        0x00u, 0x04u, 0x20u
    };
#endif /* #if (CY_CRYPTOLITE_CFG_RSA_VERIFY_SHA512 == 1) */

    uint8_t  const *encodingArr = NULL;
    uint32_t encodingArrSize = 0u;
    uint32_t locDigestSize = 0u;
    uint32_t i;
    uint32_t psLength;
    uint32_t cmpRes = 0u;


    switch (digestType)
    {

#ifdef CY_CRYPTOLITE_CFG_RSA_VERIFY_SHA1
    case CY_CRYPTOLITE_MODE_SHA1:
        encodingArr = sha1EncStr;
        encodingArrSize = sizeof(sha1EncStr);
        locDigestSize = CY_CRYPTOLITE_SHA1_DIGEST_SIZE;
        break;
#endif /* #if (CY_CRYPTOLITE_CFG_RSA_VERIFY_SHA1 == 1) */

#ifdef CY_CRYPTOLITE_CFG_RSA_VERIFY_SHA256
    case CY_CRYPTOLITE_MODE_SHA224:
        encodingArr = sha224EncStr;
        encodingArrSize = sizeof(sha224EncStr);
        locDigestSize = CY_CRYPTOLITE_SHA224_DIGEST_SIZE;
        break;

    case CY_CRYPTOLITE_MODE_SHA256:
        encodingArr = sha256EncStr;
        encodingArrSize = sizeof(sha256EncStr);
        locDigestSize = CY_CRYPTOLITE_SHA256_DIGEST_SIZE;
        break;
#endif /* #if (CY_CRYPTOLITE_CFG_RSA_VERIFY_SHA256 == 1) */

#ifdef CY_CRYPTOLITE_CFG_RSA_VERIFY_SHA512
    case CY_CRYPTOLITE_MODE_SHA384:
        encodingArr = sha384EncStr;
        encodingArrSize = sizeof(sha384EncStr);
        locDigestSize = CY_CRYPTOLITE_SHA384_DIGEST_SIZE;
        break;

