PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_rsa.c
    case CY_CRYPTOLITE_MODE_SHA512:
        encodingArr = sha512EncStr;
        encodingArrSize = sizeof(sha512EncStr);
        locDigestSize = CY_CRYPTOLITE_SHA512_DIGEST_SIZE;
        break;

    case CY_CRYPTOLITE_MODE_SHA512_224:
        encodingArr  = sha512_224EncStr;
        encodingArrSize = sizeof(sha512_224EncStr);
        locDigestSize      = CY_CRYPTOLITE_SHA512_224_DIGEST_SIZE;
        break;

    case CY_CRYPTOLITE_MODE_SHA512_256:
        encodingArr = sha512_256EncStr;
        encodingArrSize = sizeof(sha512_256EncStr);
        locDigestSize = CY_CRYPTOLITE_SHA512_256_DIGEST_SIZE;
        break;
#endif /* #if (CY_CRYPTOLITE_CFG_RSA_VERIFY_SHA512 == 1) */
    case CY_CRYPTOLITE_MODE_SHA_NONE:
        encodingArr = NULL;
        encodingArrSize = 0U;
        locDigestSize = digestLength;
        break;
    default:
        /* Unknown Digest Type */
        break;
    }

    /* Fail by default */
    *verResult = CY_CRYPTOLITE_SIG_INVALID;

    if (CY_CRYPTOLITE_MODE_SHA_NONE != digestType)
    {
        /* Check size of decrypted message */
        if (decryptedSignatureLength < (encodingArrSize + locDigestSize + 11u))
        {
            cmpRes = 1u;  /* further checking is not needed */
        }
    }

    psLength = decryptedSignatureLength - locDigestSize - encodingArrSize - 3u;

    /* Check whether the begin of message is 0x00, 0x01 and after PS string (before T string) is 0x00 byte.*/
    if ((0u != cmpRes) ||
            (0x00u != *(decryptedSignatureRemap)) ||
            (0x01u != *(decryptedSignatureRemap + 1u)) ||
            (0x00u != *(decryptedSignatureRemap + psLength + 2u)))
    {
        cmpRes = 1u;  /* Further checking is not needed */
    }

    /* Check FFs */
    if (0u == cmpRes)
    {
        for (i = 0u; i < psLength; i++)
        {
            if (0xFFu != *(decryptedSignatureRemap + 2u + i))
            {
                cmpRes = 1u;  /* Further checking is not needed */
                break;
            }
        }
    }

    if (CY_CRYPTOLITE_MODE_SHA_NONE != digestType)
    {
        /* Check the padding (T string) */
        if (0u == cmpRes)
        {
            cmpRes = Cy_Cryptolite_Vu_memcmp(encodingArr,
                                             (decryptedSignatureRemap + psLength + 3u),
                                             (uint16_t)encodingArrSize);
        }
    }

    /* Check the digest */
    if (0u == cmpRes)
    {
        cmpRes = Cy_Cryptolite_Vu_memcmp(digestRemap,
                                         (decryptedSignatureRemap + (decryptedSignatureLength - locDigestSize)),
                                         (uint16_t)locDigestSize);
    }

    if (0u == cmpRes)
    {
        *verResult = CY_CRYPTOLITE_SIG_VALID;
    }

    return (tmpResult);
}
#endif /* CY_CRYPTOLITE_CFG_RSA_VERIFY_ENABLED */

#endif  /*#if defined(CY_CRYPTOLITE_CFG_RSA_C)*/
#endif  /*#if (CPUSS_CRYPTOLITE_VU == 1)*/

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXCRYPTOLITE */
